In [157]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
pdata = pd.read_csv(file_to_load)

In [158]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [159]:
pdata.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [160]:
pdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
Purchase ID    780 non-null int64
SN             780 non-null object
Age            780 non-null int64
Gender         780 non-null object
Item ID        780 non-null int64
Item Name      780 non-null object
Price          780 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.7+ KB

In [161]:
 # The value_counts method counts unique values in a column
count = pdata["SN"].value_counts()
countot = len(count)
print(countot)

576

## Player Count

* Display the total number of players

In [162]:
countdf = pd.DataFrame([{'Total Players' : countot}])
countdf

   Total Players
0            576

In [163]:
# Heroes Of Pymoli Data Analysis
# There are a totol of 576 unique players

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [164]:
pdata.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [165]:
UItem = len(pdata['Item ID'].value_counts())
UItem

183

In [166]:
AvgP = round(float(pdata['Price'].mean()
                  ),
             2)
AvgP

3.05

In [167]:
#plen = pdata['Purchase ID'].max() + 1
plen = len(pdata['Purchase ID'])
plen

780

In [168]:
totrev = pdata['Price'].sum()
totrev

2379.77

In [169]:
PurchA = pd.DataFrame([{'Number of Unique Items' : UItem,
                        'Average Price' : AvgP,
                        'Number of Purchases' : plen,
                        'Total Revenue' : totrev
                       }])
PurchF = pd.DataFrame(PurchA, columns = ['Number of Unique Items','Average Price', 'Number of Purchases', 'Total Revenue'])
PurchF

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [170]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [171]:
gender = pdata['Gender'].unique()
gender

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [172]:
gnum = pdata.groupby(['SN'])

In [173]:
gunique = gnum['Gender'].unique().value_counts()
gunique

[Male]                     484
[Female]                    81
[Other / Non-Disclosed]     11
Name: Gender, dtype: int64

In [174]:
gdf = pd.DataFrame({'Total Count': gunique
                   })
gdf

                         Total Count
[Male]                           484
[Female]                          81
[Other / Non-Disclosed]           11

In [175]:
tot = gdf['Total Count'].sum()
tot

576

In [176]:
PoP = round(gdf['Total Count']/tot*100,2)
gdf['Percentage of Players'] = PoP

In [177]:
gdf

                         Total Count  Percentage of Players
[Male]                           484                  84.03
[Female]                          81                  14.06
[Other / Non-Disclosed]           11                   1.91

In [178]:
# Heroes Of Pymoli Data Analysis
# A vast majority of the players are male at 84%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [181]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [182]:
Purchase_Count = pdata.groupby('Gender')['Purchase ID'].count()
Purchase_Count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [183]:
avgall = round(pdata.groupby('Gender')['Price'].mean(),2)
avgall

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [184]:
avgfemale = avgall['Female']
avgfemale

3.2

In [185]:
avgmale = round((avgall['Male']),2)
avgmale

3.02

In [186]:
avgother = round(avgall['Other / Non-Disclosed'],2)
avgother

3.35

In [187]:
totall = pdata.groupby('Gender')['Price'].sum()
totall

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [188]:
countall = pdata.groupby('SN')['Gender'].unique().value_counts()
countall

[Male]                     484
[Female]                    81
[Other / Non-Disclosed]     11
Name: Gender, dtype: int64

In [189]:
fcount = countall['Female']
fcount

81

In [190]:
mcount = countall['Male']
mcount

484

In [191]:
ocount = countall['Other / Non-Disclosed']
ocount

11

In [192]:
totfemale = round(totall['Female']/fcount,2)
totfemale

4.47

In [193]:
totmale = round(totall['Male']/mcount,2)
totmale

4.07

In [194]:
toto = round(totall['Other / Non-Disclosed']/ocount,2)
toto

4.56

In [195]:
Purchasing_Summary = pd.DataFrame({'Purchase Count' : Purchase_Count,
                                   'Average Purchase Price' : avgall,
                                   'Total Purchase Value' : totall,
                                   'Avg Total Purchase per Person' :[totfemale, totmale, toto]
                         })
Purchasing_Summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [196]:
# Heroes Of Pymoli Data Analysis
# The majority of the purchases come from makes however females carry a higher per purchase value

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [197]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [198]:
bins =  [0,   9,      14,      19,     24,     29,     34,     39,       100]
blabels = ['<10', '10-14', '15-19','20-24','25-29','30-34','35-39','40+']

In [199]:
pdata['Bin'] = pd.cut(pdata['Age'],bins=bins,labels = blabels)
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Bin
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [200]:
agesum = pdata.groupby('Bin').nunique()
agesum

       Purchase ID   SN  Age  Gender  Item ID  Item Name  Price  Bin
Bin
<10             23   17    3       2       22         21     21    1
10-14           28   22    5       2       24         24     24    1
15-19          136  107    5       3       96         96     83    1
20-24          365  258    5       3      166        163    135    1
25-29          101   77    5       3       78         78     73    1
30-34           73   52    5       2       60         60     56    1
35-39           41   31    5       3       37         37     34    1
40+             13   12    6       2       13         13     13    1

In [201]:
test = agesum['SN']
test

Bin
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [202]:
agesum = pdata.groupby('Bin').nunique()
agesum['Percentage of Players'] = ((agesum['SN']/countot)*100).map('{:.2f}'.format)
agesum.rename(columns={"SN": "Total Count"},inplace=True)
agesum.filter(items=['Total Count', 'Percentage of Players'])

       Total Count Percentage of Players
Bin
<10             17                  2.95
10-14           22                  3.82
15-19          107                 18.58
20-24          258                 44.79
25-29           77                 13.37
30-34           52                  9.03
35-39           31                  5.38
40+             12                  2.08

In [203]:
# Heroes Of Pymoli Data Analysis
# Most of the players are in the 20-24 age range.

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [204]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Bin
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [205]:
ppdata = pdata.groupby('Bin').nunique()

In [206]:
ppdata = pdata.groupby('Bin').nunique()
pca = ppdata['SN']

In [207]:
pca = pdata.groupby('Bin')['Purchase ID'].count()

In [208]:
avgppa = pdata.groupby('Bin')['Price'].mean()

In [209]:
totpv = pdata.groupby('Bin')['Price'].sum()

In [210]:
atp10 = round(totpv['<10']/pca['<10'],2)
atp14 = round(totpv['10-14']/pca['10-14'],2)
atp19 = round(totpv['15-19']/pca['15-19'],2)
atp24 = round(totpv['20-24']/pca['20-24'],2)
atp29 = round(totpv['25-29']/pca['25-29'],2)
atp34 = round(totpv['30-34']/pca['30-34'],2)
atp39 = round(totpv['35-39']/pca['35-39'],2)
atp40 = round(totpv['40+']/pca['40+'],2)

In [211]:
agestage = pd.DataFrame({
                         'Purchase Count' : pca,
                         'Average Purchase Price': round(avgppa,2),
                         'Total Purchase Value' : totpv,
                         'Avg total Purchase per Person' : [atp10, atp14, atp19, atp24, atp29, atp34, atp39, atp40]
                          })
agestage

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg total Purchase per Person
Bin,,,,
<10,23,3.35,77.13,3.35
10-14,28,2.96,82.78,2.96
15-19,136,3.04,412.89,3.04
20-24,365,3.05,1114.06,3.05
25-29,101,2.90,293.00,2.90
30-34,73,2.93,214.00,2.93
35-39,41,3.60,147.67,3.60
40+,13,2.94,38.24,2.94

In [212]:
# Heroes Of Pymoli Data Analysis
# Most of purchases are by 20-24 however the 35-39 group spends the most per purchase

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [213]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Bin
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [214]:
pdatas = pdata.sort_values('SN', ascending=False)
pdatas.head()

     Purchase ID          SN  Age Gender  Item ID   Item Name  Price    Bin
17            17   Zontibe81   21   Male      161      Devine   1.76  20-24
442          442   Zontibe81   21   Male       84  Arcane Gem   3.79  20-24
560          560   Zontibe81   21   Male        2     Verdict   2.48  20-24
141          141  Zhisrisu83   10   Male       60        Wolf   3.54  10-14
54            54  Zhisrisu83   10   Male       25   Hero Cane   4.35  10-14

In [215]:
pcts = pdatas.groupby('SN')['Purchase ID'].count()
pcts.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Purchase ID, dtype: int64

In [216]:
tavgpp = pdatas.groupby('SN')['Price'].mean()
tavgpp.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [217]:
ttotpv = pdatas.groupby('SN')['Price'].sum()

In [218]:
tstable = pd.DataFrame({ 
                         'Purchase Count': pcts,
                         'Average Purchase Price' : round(tavgpp,2),
                         'Total Purchase Value' : ttotpv
                          })

In [219]:
tstables = tstable.sort_values('Total Purchase Value', ascending=False)
tstables.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [220]:
pdata.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Bin
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [221]:
ppdatanew = pdata[['Item ID', 'Item Name', 'Price', 'Purchase ID']]
ppdatanew.head(3)

   Item ID                                  Item Name  Price  Purchase ID
0      108  Extraction, Quickblade Of Trembling Hands   3.53            0
1      143                          Frenzied Scimitar   1.56            1
2       92                               Final Critic   4.88            2

In [222]:
ppdatanewg = ppdatanew.groupby(['Item ID', 'Item Name'])

In [223]:
ppc = ppdatanewg['Purchase ID'].count()
pip = ppdatanewg['Price'].unique()
ptpv = ppdatanewg['Price'].sum()

In [224]:
mptable = pd.DataFrame({ 
                         'Purchase Count': ppc,
                         'Item Price' : pip,
                         'Total Purchase Value' : ptpv
                          })
mptable.head()

                            Purchase Count Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4     [1.28]                  5.12
1       Crucifer                         3     [3.26]                  9.78
2       Verdict                          6     [2.48]                 14.88
3       Phantomlight                     6     [2.49]                 14.94
4       Bloodlord's Fetish               5      [1.7]                  8.50

In [225]:
mptables = mptable.sort_values('Purchase Count', ascending=False)
mptables.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,[4.23],50.76
145,Fiery Glass Crusader,9,[4.58],41.22
108,"Extraction, Quickblade Of Trembling Hands",9,[3.53],31.77
82,Nirvana,9,[4.9],44.10
19,"Pursuit, Cudgel of Necromancy",8,[1.02],8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [227]:
mptables = mptable.sort_values('Purchase Count', ascending=False)
mptables.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,[4.23],50.76
145,Fiery Glass Crusader,9,[4.58],41.22
108,"Extraction, Quickblade Of Trembling Hands",9,[3.53],31.77
82,Nirvana,9,[4.9],44.10
19,"Pursuit, Cudgel of Necromancy",8,[1.02],8.16

In [ ]:
# Heroes Of Pymoli Data Analysis
# The Oathbreaker is the most popular item